[{"name":"config.storage.topic","documentation":"The name of the Kafka topic where connector configurations are stored","headers":{"Type":"string","Default":"","Valid Values":"","Importance":"high"}},{"name":"group.id","documentation":"A unique string that identifies the Connect cluster group this worker belongs to.","headers":{"Type":"string","Default":"","Valid Values":"","Importance":"high"}},{"name":"key.converter","documentation":"Converter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the keys in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro.","headers":{"Type":"class","Default":"","Valid Values":"","Importance":"high"}},{"name":"offset.storage.topic","documentation":"The name of the Kafka topic where source connector offsets are stored","headers":{"Type":"string","Default":"","Valid Values":"","Importance":"high"}},{"name":"status.storage.topic","documentation":"The name of the Kafka topic where connector and task status are stored","headers":{"Type":"string","Default":"","Valid Values":"","Importance":"high"}},{"name":"value.converter","documentation":"Converter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the values in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro.","headers":{"Type":"class","Default":"","Valid Values":"","Importance":"high"}},{"name":"bootstrap.servers","documentation":"A list of host/port pairs to use for establishing the initial connection to the Kafka cluster. The client will make use of all servers irrespective of which servers are specified here for bootstrapping&mdash;this list only impacts the initial hosts used to discover the full set of servers. This list should be in the form <code>host1:port1,host2:port2,...</code>. Since these servers are just used for the initial connection to discover the full cluster membership (which may change dynamically), this list need not contain the full set of servers (you may want more than one, though, in case a server is down).","headers":{"Type":"list","Default":"localhost:9092","Valid Values":"","Importance":"high"}},{"name":"exactly.once.source.support","documentation":"Whether to enable exactly-once support for source connectors in the cluster by using transactions to write source records and their source offsets, and by proactively fencing out old task generations before bringing up new ones.<br>To enable exactly-once source support on a new cluster, set this property to 'enabled'. To enable support on an existing cluster, first set to 'preparing' on every worker in the cluster, then set to 'enabled'. A rolling upgrade may be used for both changes. For more information on this feature, see the <a href=\"https://kafka.apache.org/documentation.html#connect_exactlyoncesource\">exactly-once source support documentation</a>.","headers":{"Type":"string","Default":"disabled","Valid Values":"(case insensitive) [DISABLED, ENABLED, PREPARING]","Importance":"high"}},{"name":"heartbeat.interval.ms","documentation":"The expected time between heartbeats to the group coordinator when using Kafka's group management facilities. Heartbeats are used to ensure that the worker's session stays active and to facilitate rebalancing when new members join or leave the group. The value must be set lower than <code>session.timeout.ms</code>, but typically should be set no higher than 1/3 of that value. It can be adjusted even lower to control the expected time for normal rebalances.","headers":{"Type":"int","Default":"3000 (3 seconds)","Valid Values":"","Importance":"high"}},{"name":"rebalance.timeout.ms","documentation":"The maximum allowed time for each worker to join the group once a rebalance has begun. This is basically a limit on the amount of time needed for all tasks to flush any pending data and commit offsets. If the timeout is exceeded, then the worker will be removed from the group, which will cause offset commit failures.","headers":{"Type":"int","Default":"60000 (1 minute)","Valid Values":"","Importance":"high"}},{"name":"session.timeout.ms","documentation":"The timeout used to detect worker failures. The worker sends periodic heartbeats to indicate its liveness to the broker. If no heartbeats are received by the broker before the expiration of this session timeout, then the broker will remove the worker from the group and initiate a rebalance. Note that the value must be in the allowable range as configured in the broker configuration by <code>group.min.session.timeout.ms</code> and <code>group.max.session.timeout.ms</code>.","headers":{"Type":"int","Default":"10000 (10 seconds)","Valid Values":"","Importance":"high"}},{"name":"ssl.key.password","documentation":"The password of the private key in the key store file or the PEM key specified in 'ssl.keystore.key'.","headers":{"Type":"password","Default":"null","Valid Values":"","Importance":"high"}},{"name":"ssl.keystore.certificate.chain","documentation":"Certificate chain in the format specified by 'ssl.keystore.type'. Default SSL engine factory supports only PEM format with a list of X.509 certificates","headers":{"Type":"password","Default":"null","Valid Values":"","Importance":"high"}},{"name":"ssl.keystore.key","documentation":"Private key in the format specified by 'ssl.keystore.type'. Default SSL engine factory supports only PEM format with PKCS#8 keys. If the key is encrypted, key password must be specified using 'ssl.key.password'","headers":{"Type":"password","Default":"null","Valid Values":"","Importance":"high"}},{"name":"ssl.keystore.location","documentation":"The location of the key store file. This is optional for client and can be used for two-way authentication for client.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"high"}},{"name":"ssl.keystore.password","documentation":"The store password for the key store file. This is optional for client and only needed if 'ssl.keystore.location' is configured. Key store password is not supported for PEM format.","headers":{"Type":"password","Default":"null","Valid Values":"","Importance":"high"}},{"name":"ssl.truststore.certificates","documentation":"Trusted certificates in the format specified by 'ssl.truststore.type'. Default SSL engine factory supports only PEM format with X.509 certificates.","headers":{"Type":"password","Default":"null","Valid Values":"","Importance":"high"}},{"name":"ssl.truststore.location","documentation":"The location of the trust store file.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"high"}},{"name":"ssl.truststore.password","documentation":"The password for the trust store file. If a password is not set, trust store file configured will still be used, but integrity checking is disabled. Trust store password is not supported for PEM format.","headers":{"Type":"password","Default":"null","Valid Values":"","Importance":"high"}},{"name":"client.dns.lookup","documentation":"Controls how the client uses DNS lookups. If set to <code>use_all_dns_ips</code>, connect to each returned IP address in sequence until a successful connection is established. After a disconnection, the next IP is used. Once all IPs have been used once, the client resolves the IP(s) from the hostname again (both the JVM and the OS cache DNS name lookups, however). If set to <code>resolve_canonical_bootstrap_servers_only</code>, resolve each bootstrap address into a list of canonical names. After the bootstrap phase, this behaves the same as <code>use_all_dns_ips</code>.","headers":{"Type":"string","Default":"use_all_dns_ips","Valid Values":"[use_all_dns_ips, resolve_canonical_bootstrap_servers_only]","Importance":"medium"}},{"name":"connections.max.idle.ms","documentation":"Close idle connections after the number of milliseconds specified by this config.","headers":{"Type":"long","Default":"540000 (9 minutes)","Valid Values":"","Importance":"medium"}},{"name":"connector.client.config.override.policy","documentation":"Class name or alias of implementation of <code>ConnectorClientConfigOverridePolicy</code>. Defines what client configurations can be overridden by the connector. The default implementation is `All`, meaning connector configurations can override all client properties. The other possible policies in the framework include `None` to disallow connectors from overriding client properties, and `Principal` to allow connectors to override only client principals.","headers":{"Type":"string","Default":"All","Valid Values":"","Importance":"medium"}},{"name":"receive.buffer.bytes","documentation":"The size of the TCP receive buffer (SO_RCVBUF) to use when reading data. If the value is -1, the OS default will be used.","headers":{"Type":"int","Default":"32768 (32 kibibytes)","Valid Values":"[0,...]","Importance":"medium"}},{"name":"request.timeout.ms","documentation":"The configuration controls the maximum amount of time the client will wait for the response of a request. If the response is not received before the timeout elapses the client will resend the request if necessary or fail the request if retries are exhausted.","headers":{"Type":"int","Default":"40000 (40 seconds)","Valid Values":"[0,...]","Importance":"medium"}},{"name":"sasl.client.callback.handler.class","documentation":"The fully qualified name of a SASL client callback handler class that implements the AuthenticateCallbackHandler interface.","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"sasl.jaas.config","documentation":"JAAS login context parameters for SASL connections in the format used by JAAS configuration files. JAAS configuration file format is described <a href=\"http://docs.oracle.com/javase/8/docs/technotes/guides/security/jgss/tutorials/LoginConfigFile.html\">here</a>. The format for the value is: <code>loginModuleClass controlFlag (optionName=optionValue)*;</code>. For brokers, the config must be prefixed with listener prefix and SASL mechanism name in lower-case. For example, listener.name.sasl_ssl.scram-sha-256.sasl.jaas.config=com.example.ScramLoginModule required;","headers":{"Type":"password","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"sasl.kerberos.service.name","documentation":"The Kerberos principal name that Kafka runs as. This can be defined either in Kafka's JAAS config or in Kafka's config.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"sasl.login.callback.handler.class","documentation":"The fully qualified name of a SASL login callback handler class that implements the AuthenticateCallbackHandler interface. For brokers, login callback handler config must be prefixed with listener prefix and SASL mechanism name in lower-case. For example, listener.name.sasl_ssl.scram-sha-256.sasl.login.callback.handler.class=com.example.CustomScramLoginCallbackHandler","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"sasl.login.class","documentation":"The fully qualified name of a class that implements the Login interface. For brokers, login config must be prefixed with listener prefix and SASL mechanism name in lower-case. For example, listener.name.sasl_ssl.scram-sha-256.sasl.login.class=com.example.CustomScramLogin","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"sasl.mechanism","documentation":"SASL mechanism used for client connections. This may be any mechanism for which a security provider is available. GSSAPI is the default mechanism.","headers":{"Type":"string","Default":"GSSAPI","Valid Values":"","Importance":"medium"}},{"name":"sasl.oauthbearer.jwks.endpoint.url","documentation":"The OAuth/OIDC provider URL from which the provider's <a href=\"https://datatracker.ietf.org/doc/html/rfc7517#section-5\">JWKS (JSON Web Key Set)</a> can be retrieved. The URL can be HTTP(S)-based or file-based. If the URL is HTTP(S)-based, the JWKS data will be retrieved from the OAuth/OIDC provider via the configured URL on broker startup. All then-current keys will be cached on the broker for incoming requests. If an authentication request is received for a JWT that includes a \"kid\" header claim value that isn't yet in the cache, the JWKS endpoint will be queried again on demand. However, the broker polls the URL every sasl.oauthbearer.jwks.endpoint.refresh.ms milliseconds to refresh the cache with any forthcoming keys before any JWT requests that include them are received. If the URL is file-based, the broker will load the JWKS file from a configured location on startup. In the event that the JWT includes a \"kid\" header value that isn't in the JWKS file, the broker will reject the JWT and authentication will fail.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"sasl.oauthbearer.token.endpoint.url","documentation":"The URL for the OAuth/OIDC identity provider. If the URL is HTTP(S)-based, it is the issuer's token endpoint URL to which requests will be made to login based on the configuration in sasl.jaas.config. If the URL is file-based, it specifies a file containing an access token (in JWT serialized form) issued by the OAuth/OIDC identity provider to use for authorization.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"security.protocol","documentation":"Protocol used to communicate with brokers. Valid values are: PLAINTEXT, SSL, SASL_PLAINTEXT, SASL_SSL.","headers":{"Type":"string","Default":"PLAINTEXT","Valid Values":"[PLAINTEXT, SSL, SASL_PLAINTEXT, SASL_SSL]","Importance":"medium"}},{"name":"send.buffer.bytes","documentation":"The size of the TCP send buffer (SO_SNDBUF) to use when sending data. If the value is -1, the OS default will be used.","headers":{"Type":"int","Default":"131072 (128 kibibytes)","Valid Values":"[0,...]","Importance":"medium"}},{"name":"ssl.enabled.protocols","documentation":"The list of protocols enabled for SSL connections. The default is 'TLSv1.2,TLSv1.3' when running with Java 11 or newer, 'TLSv1.2' otherwise. With the default value for Java 11, clients and servers will prefer TLSv1.3 if both support it and fallback to TLSv1.2 otherwise (assuming both support at least TLSv1.2). This default should be fine for most cases. Also see the config documentation for `ssl.protocol`.","headers":{"Type":"list","Default":"TLSv1.2,TLSv1.3","Valid Values":"","Importance":"medium"}},{"name":"ssl.keystore.type","documentation":"The file format of the key store file. This is optional for client. The values currently supported by the default `ssl.engine.factory.class` are [JKS, PKCS12, PEM].","headers":{"Type":"string","Default":"JKS","Valid Values":"","Importance":"medium"}},{"name":"ssl.protocol","documentation":"The SSL protocol used to generate the SSLContext. The default is 'TLSv1.3' when running with Java 11 or newer, 'TLSv1.2' otherwise. This value should be fine for most use cases. Allowed values in recent JVMs are 'TLSv1.2' and 'TLSv1.3'. 'TLS', 'TLSv1.1', 'SSL', 'SSLv2' and 'SSLv3' may be supported in older JVMs, but their usage is discouraged due to known security vulnerabilities. With the default value for this config and 'ssl.enabled.protocols', clients will downgrade to 'TLSv1.2' if the server does not support 'TLSv1.3'. If this config is set to 'TLSv1.2', clients will not use 'TLSv1.3' even if it is one of the values in ssl.enabled.protocols and the server only supports 'TLSv1.3'.","headers":{"Type":"string","Default":"TLSv1.3","Valid Values":"","Importance":"medium"}},{"name":"ssl.provider","documentation":"The name of the security provider used for SSL connections. Default value is the default security provider of the JVM.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"medium"}},{"name":"ssl.truststore.type","documentation":"The file format of the trust store file. The values currently supported by the default `ssl.engine.factory.class` are [JKS, PKCS12, PEM].","headers":{"Type":"string","Default":"JKS","Valid Values":"","Importance":"medium"}},{"name":"worker.sync.timeout.ms","documentation":"When the worker is out of sync with other workers and needs to resynchronize configurations, wait up to this amount of time before giving up, leaving the group, and waiting a backoff period before rejoining.","headers":{"Type":"int","Default":"3000 (3 seconds)","Valid Values":"","Importance":"medium"}},{"name":"worker.unsync.backoff.ms","documentation":"When the worker is out of sync with other workers and  fails to catch up within worker.sync.timeout.ms, leave the Connect cluster for this long before rejoining.","headers":{"Type":"int","Default":"300000 (5 minutes)","Valid Values":"","Importance":"medium"}},{"name":"access.control.allow.methods","documentation":"Sets the methods supported for cross origin requests by setting the Access-Control-Allow-Methods header. The default value of the Access-Control-Allow-Methods header allows cross origin requests for GET, POST and HEAD.","headers":{"Type":"string","Default":"\"\"","Valid Values":"","Importance":"low"}},{"name":"access.control.allow.origin","documentation":"Value to set the Access-Control-Allow-Origin header to for REST API requests.To enable cross origin access, set this to the domain of the application that should be permitted to access the API, or '*' to allow access from any domain. The default value only allows access from the domain of the REST API.","headers":{"Type":"string","Default":"\"\"","Valid Values":"","Importance":"low"}},{"name":"admin.listeners","documentation":"List of comma-separated URIs the Admin REST API will listen on. The supported protocols are HTTP and HTTPS. An empty or blank string will disable this feature. The default behavior is to use the regular listener (specified by the 'listeners' property).","headers":{"Type":"list","Default":"null","Valid Values":"List of comma-separated URLs, ex: http://localhost:8080,https://localhost:8443.","Importance":"low"}},{"name":"auto.include.jmx.reporter","documentation":"Deprecated. Whether to automatically include JmxReporter even if it's not listed in <code>metric.reporters</code>. This configuration will be removed in Kafka 4.0, users should instead include <code>org.apache.kafka.common.metrics.JmxReporter</code> in <code>metric.reporters</code> in order to enable the JmxReporter.","headers":{"Type":"boolean","Default":"true","Valid Values":"","Importance":"low"}},{"name":"client.id","documentation":"An id string to pass to the server when making requests. The purpose of this is to be able to track the source of requests beyond just ip/port by allowing a logical application name to be included in server-side request logging.","headers":{"Type":"string","Default":"\"\"","Valid Values":"","Importance":"low"}},{"name":"config.providers","documentation":"Comma-separated names of <code>ConfigProvider</code> classes, loaded and used in the order specified. Implementing the interface  <code>ConfigProvider</code> allows you to replace variable references in connector configurations, such as for externalized secrets. ","headers":{"Type":"list","Default":"\"\"","Valid Values":"","Importance":"low"}},{"name":"config.storage.replication.factor","documentation":"Replication factor used when creating the configuration storage topic","headers":{"Type":"short","Default":"3","Valid Values":"Positive number not larger than the number of brokers in the Kafka cluster, or -1 to use the broker's default","Importance":"low"}},{"name":"connect.protocol","documentation":"Compatibility mode for Kafka Connect Protocol","headers":{"Type":"string","Default":"sessioned","Valid Values":"[eager, compatible, sessioned]","Importance":"low"}},{"name":"header.converter","documentation":"HeaderConverter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the header values in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro. By default, the SimpleHeaderConverter is used to serialize header values to strings and deserialize them by inferring the schemas.","headers":{"Type":"class","Default":"org.apache.kafka.connect.storage.SimpleHeaderConverter","Valid Values":"","Importance":"low"}},{"name":"inter.worker.key.generation.algorithm","documentation":"The algorithm to use for generating internal request keys. The algorithm 'HmacSHA256' will be used as a default on JVMs that support it; on other JVMs, no default is used and a value for this property must be manually specified in the worker config.","headers":{"Type":"string","Default":"HmacSHA256","Valid Values":"Any KeyGenerator algorithm supported by the worker JVM","Importance":"low"}},{"name":"inter.worker.key.size","documentation":"The size of the key to use for signing internal requests, in bits. If null, the default key size for the key generation algorithm will be used.","headers":{"Type":"int","Default":"null","Valid Values":"","Importance":"low"}},{"name":"inter.worker.key.ttl.ms","documentation":"The TTL of generated session keys used for internal request validation (in milliseconds)","headers":{"Type":"int","Default":"3600000 (1 hour)","Valid Values":"[0,...,2147483647]","Importance":"low"}},{"name":"inter.worker.signature.algorithm","documentation":"The algorithm used to sign internal requestsThe algorithm 'inter.worker.signature.algorithm' will be used as a default on JVMs that support it; on other JVMs, no default is used and a value for this property must be manually specified in the worker config.","headers":{"Type":"string","Default":"HmacSHA256","Valid Values":"Any MAC algorithm supported by the worker JVM","Importance":"low"}},{"name":"inter.worker.verification.algorithms","documentation":"A list of permitted algorithms for verifying internal requests, which must include the algorithm used for the inter.worker.signature.algorithm property. The algorithm(s) '[HmacSHA256]' will be used as a default on JVMs that provide them; on other JVMs, no default is used and a value for this property must be manually specified in the worker config.","headers":{"Type":"list","Default":"HmacSHA256","Valid Values":"A list of one or more MAC algorithms, each supported by the worker JVM","Importance":"low"}},{"name":"listeners","documentation":"List of comma-separated URIs the REST API will listen on. The supported protocols are HTTP and HTTPS.<br> Specify hostname as 0.0.0.0 to bind to all interfaces.<br> Leave hostname empty to bind to default interface.<br> Examples of legal listener lists: HTTP://myhost:8083,HTTPS://myhost:8084","headers":{"Type":"list","Default":"http://:8083","Valid Values":"List of comma-separated URLs, ex: http://localhost:8080,https://localhost:8443.","Importance":"low"}},{"name":"metadata.max.age.ms","documentation":"The period of time in milliseconds after which we force a refresh of metadata even if we haven't seen any partition leadership changes to proactively discover any new brokers or partitions.","headers":{"Type":"long","Default":"300000 (5 minutes)","Valid Values":"[0,...]","Importance":"low"}},{"name":"metric.reporters","documentation":"A list of classes to use as metrics reporters. Implementing the <code>org.apache.kafka.common.metrics.MetricsReporter</code> interface allows plugging in classes that will be notified of new metric creation. The JmxReporter is always included to register JMX statistics.","headers":{"Type":"list","Default":"\"\"","Valid Values":"","Importance":"low"}},{"name":"metrics.num.samples","documentation":"The number of samples maintained to compute metrics.","headers":{"Type":"int","Default":"2","Valid Values":"[1,...]","Importance":"low"}},{"name":"metrics.recording.level","documentation":"The highest recording level for metrics.","headers":{"Type":"string","Default":"INFO","Valid Values":"[INFO, DEBUG]","Importance":"low"}},{"name":"metrics.sample.window.ms","documentation":"The window of time a metrics sample is computed over.","headers":{"Type":"long","Default":"30000 (30 seconds)","Valid Values":"[0,...]","Importance":"low"}},{"name":"offset.flush.interval.ms","documentation":"Interval at which to try committing offsets for tasks.","headers":{"Type":"long","Default":"60000 (1 minute)","Valid Values":"","Importance":"low"}},{"name":"offset.flush.timeout.ms","documentation":"Maximum number of milliseconds to wait for records to flush and partition offset data to be committed to offset storage before cancelling the process and restoring the offset data to be committed in a future attempt. This property has no effect for source connectors running with exactly-once support.","headers":{"Type":"long","Default":"5000 (5 seconds)","Valid Values":"","Importance":"low"}},{"name":"offset.storage.partitions","documentation":"The number of partitions used when creating the offset storage topic","headers":{"Type":"int","Default":"25","Valid Values":"Positive number, or -1 to use the broker's default","Importance":"low"}},{"name":"offset.storage.replication.factor","documentation":"Replication factor used when creating the offset storage topic","headers":{"Type":"short","Default":"3","Valid Values":"Positive number not larger than the number of brokers in the Kafka cluster, or -1 to use the broker's default","Importance":"low"}},{"name":"plugin.path","documentation":"List of paths separated by commas (,) that contain plugins (connectors, converters, transformations). The list should consist of top level directories that include any combination of: <br>a) directories immediately containing jars with plugins and their dependencies<br>b) uber-jars with plugins and their dependencies<br>c) directories immediately containing the package directory structure of classes of plugins and their dependencies<br>Note: symlinks will be followed to discover dependencies or plugins.<br>Examples: plugin.path=/usr/local/share/java,/usr/local/share/kafka/plugins,/opt/connectors<br>Do not use config provider variables in this property, since the raw path is used by the worker's scanner before config providers are initialized and used to replace variables.","headers":{"Type":"list","Default":"null","Valid Values":"","Importance":"low"}},{"name":"reconnect.backoff.max.ms","documentation":"The maximum amount of time in milliseconds to wait when reconnecting to a broker that has repeatedly failed to connect. If provided, the backoff per host will increase exponentially for each consecutive connection failure, up to this maximum. After calculating the backoff increase, 20% random jitter is added to avoid connection storms.","headers":{"Type":"long","Default":"1000 (1 second)","Valid Values":"[0,...]","Importance":"low"}},{"name":"reconnect.backoff.ms","documentation":"The base amount of time to wait before attempting to reconnect to a given host. This avoids repeatedly connecting to a host in a tight loop. This backoff applies to all connection attempts by the client to a broker.","headers":{"Type":"long","Default":"50","Valid Values":"[0,...]","Importance":"low"}},{"name":"response.http.headers.config","documentation":"Rules for REST API HTTP response headers","headers":{"Type":"string","Default":"\"\"","Valid Values":"Comma-separated header rules, where each header rule is of the form '[action] [header name]:[header value]' and optionally surrounded by double quotes if any part of a header rule contains a comma","Importance":"low"}},{"name":"rest.advertised.host.name","documentation":"If this is set, this is the hostname that will be given out to other workers to connect to.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"low"}},{"name":"rest.advertised.listener","documentation":"Sets the advertised listener (HTTP or HTTPS) which will be given to other workers to use.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"low"}},{"name":"rest.advertised.port","documentation":"If this is set, this is the port that will be given out to other workers to connect to.","headers":{"Type":"int","Default":"null","Valid Values":"","Importance":"low"}},{"name":"rest.extension.classes","documentation":"Comma-separated names of <code>ConnectRestExtension</code> classes, loaded and called in the order specified. Implementing the interface  <code>ConnectRestExtension</code> allows you to inject into Connect's REST API user defined resources like filters. Typically used to add custom capability like logging, security, etc. ","headers":{"Type":"list","Default":"\"\"","Valid Values":"","Importance":"low"}},{"name":"retry.backoff.ms","documentation":"The amount of time to wait before attempting to retry a failed request to a given topic partition. This avoids repeatedly sending requests in a tight loop under some failure scenarios.","headers":{"Type":"long","Default":"100","Valid Values":"[0,...]","Importance":"low"}},{"name":"sasl.kerberos.kinit.cmd","documentation":"Kerberos kinit command path.","headers":{"Type":"string","Default":"/usr/bin/kinit","Valid Values":"","Importance":"low"}},{"name":"sasl.kerberos.min.time.before.relogin","documentation":"Login thread sleep time between refresh attempts.","headers":{"Type":"long","Default":"60000","Valid Values":"","Importance":"low"}},{"name":"sasl.kerberos.ticket.renew.jitter","documentation":"Percentage of random jitter added to the renewal time.","headers":{"Type":"double","Default":"0.05","Valid Values":"","Importance":"low"}},{"name":"sasl.kerberos.ticket.renew.window.factor","documentation":"Login thread will sleep until the specified window factor of time from last refresh to ticket's expiry has been reached, at which time it will try to renew the ticket.","headers":{"Type":"double","Default":"0.8","Valid Values":"","Importance":"low"}},{"name":"sasl.login.connect.timeout.ms","documentation":"The (optional) value in milliseconds for the external authentication provider connection timeout. Currently applies only to OAUTHBEARER.","headers":{"Type":"int","Default":"null","Valid Values":"","Importance":"low"}},{"name":"sasl.login.read.timeout.ms","documentation":"The (optional) value in milliseconds for the external authentication provider read timeout. Currently applies only to OAUTHBEARER.","headers":{"Type":"int","Default":"null","Valid Values":"","Importance":"low"}},{"name":"sasl.login.refresh.buffer.seconds","documentation":"The amount of buffer time before credential expiration to maintain when refreshing a credential, in seconds. If a refresh would otherwise occur closer to expiration than the number of buffer seconds then the refresh will be moved up to maintain as much of the buffer time as possible. Legal values are between 0 and 3600 (1 hour); a default value of  300 (5 minutes) is used if no value is specified. This value and sasl.login.refresh.min.period.seconds are both ignored if their sum exceeds the remaining lifetime of a credential. Currently applies only to OAUTHBEARER.","headers":{"Type":"short","Default":"300","Valid Values":"[0,...,3600]","Importance":"low"}},{"name":"sasl.login.refresh.min.period.seconds","documentation":"The desired minimum time for the login refresh thread to wait before refreshing a credential, in seconds. Legal values are between 0 and 900 (15 minutes); a default value of 60 (1 minute) is used if no value is specified.  This value and  sasl.login.refresh.buffer.seconds are both ignored if their sum exceeds the remaining lifetime of a credential. Currently applies only to OAUTHBEARER.","headers":{"Type":"short","Default":"60","Valid Values":"[0,...,900]","Importance":"low"}},{"name":"sasl.login.refresh.window.factor","documentation":"Login refresh thread will sleep until the specified window factor relative to the credential's lifetime has been reached, at which time it will try to refresh the credential. Legal values are between 0.5 (50%) and 1.0 (100%) inclusive; a default value of 0.8 (80%) is used if no value is specified. Currently applies only to OAUTHBEARER.","headers":{"Type":"double","Default":"0.8","Valid Values":"[0.5,...,1.0]","Importance":"low"}},{"name":"sasl.login.refresh.window.jitter","documentation":"The maximum amount of random jitter relative to the credential's lifetime that is added to the login refresh thread's sleep time. Legal values are between 0 and 0.25 (25%) inclusive; a default value of 0.05 (5%) is used if no value is specified. Currently applies only to OAUTHBEARER.","headers":{"Type":"double","Default":"0.05","Valid Values":"[0.0,...,0.25]","Importance":"low"}},{"name":"sasl.login.retry.backoff.max.ms","documentation":"The (optional) value in milliseconds for the maximum wait between login attempts to the external authentication provider. Login uses an exponential backoff algorithm with an initial wait based on the sasl.login.retry.backoff.ms setting and will double in wait length between attempts up to a maximum wait length specified by the sasl.login.retry.backoff.max.ms setting. Currently applies only to OAUTHBEARER.","headers":{"Type":"long","Default":"10000 (10 seconds)","Valid Values":"","Importance":"low"}},{"name":"sasl.login.retry.backoff.ms","documentation":"The (optional) value in milliseconds for the initial wait between login attempts to the external authentication provider. Login uses an exponential backoff algorithm with an initial wait based on the sasl.login.retry.backoff.ms setting and will double in wait length between attempts up to a maximum wait length specified by the sasl.login.retry.backoff.max.ms setting. Currently applies only to OAUTHBEARER.","headers":{"Type":"long","Default":"100","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.clock.skew.seconds","documentation":"The (optional) value in seconds to allow for differences between the time of the OAuth/OIDC identity provider and the broker.","headers":{"Type":"int","Default":"30","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.expected.audience","documentation":"The (optional) comma-delimited setting for the broker to use to verify that the JWT was issued for one of the expected audiences. The JWT will be inspected for the standard OAuth \"aud\" claim and if this value is set, the broker will match the value from JWT's \"aud\" claim  to see if there is an exact match. If there is no match, the broker will reject the JWT and authentication will fail.","headers":{"Type":"list","Default":"null","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.expected.issuer","documentation":"The (optional) setting for the broker to use to verify that the JWT was created by the expected issuer. The JWT will be inspected for the standard OAuth \"iss\" claim and if this value is set, the broker will match it exactly against what is in the JWT's \"iss\" claim. If there is no match, the broker will reject the JWT and authentication will fail.","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.jwks.endpoint.refresh.ms","documentation":"The (optional) value in milliseconds for the broker to wait between refreshing its JWKS (JSON Web Key Set) cache that contains the keys to verify the signature of the JWT.","headers":{"Type":"long","Default":"3600000 (1 hour)","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.jwks.endpoint.retry.backoff.max.ms","documentation":"The (optional) value in milliseconds for the maximum wait between attempts to retrieve the JWKS (JSON Web Key Set) from the external authentication provider. JWKS retrieval uses an exponential backoff algorithm with an initial wait based on the sasl.oauthbearer.jwks.endpoint.retry.backoff.ms setting and will double in wait length between attempts up to a maximum wait length specified by the sasl.oauthbearer.jwks.endpoint.retry.backoff.max.ms setting.","headers":{"Type":"long","Default":"10000 (10 seconds)","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.jwks.endpoint.retry.backoff.ms","documentation":"The (optional) value in milliseconds for the initial wait between JWKS (JSON Web Key Set) retrieval attempts from the external authentication provider. JWKS retrieval uses an exponential backoff algorithm with an initial wait based on the sasl.oauthbearer.jwks.endpoint.retry.backoff.ms setting and will double in wait length between attempts up to a maximum wait length specified by the sasl.oauthbearer.jwks.endpoint.retry.backoff.max.ms setting.","headers":{"Type":"long","Default":"100","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.scope.claim.name","documentation":"The OAuth claim for the scope is often named \"scope\", but this (optional) setting can provide a different name to use for the scope included in the JWT payload's claims if the OAuth/OIDC provider uses a different name for that claim.","headers":{"Type":"string","Default":"scope","Valid Values":"","Importance":"low"}},{"name":"sasl.oauthbearer.sub.claim.name","documentation":"The OAuth claim for the subject is often named \"sub\", but this (optional) setting can provide a different name to use for the subject included in the JWT payload's claims if the OAuth/OIDC provider uses a different name for that claim.","headers":{"Type":"string","Default":"sub","Valid Values":"","Importance":"low"}},{"name":"scheduled.rebalance.max.delay.ms","documentation":"The maximum delay that is scheduled in order to wait for the return of one or more departed workers before rebalancing and reassigning their connectors and tasks to the group. During this period the connectors and tasks of the departed workers remain unassigned","headers":{"Type":"int","Default":"300000 (5 minutes)","Valid Values":"[0,...,2147483647]","Importance":"low"}},{"name":"socket.connection.setup.timeout.max.ms","documentation":"The maximum amount of time the client will wait for the socket connection to be established. The connection setup timeout will increase exponentially for each consecutive connection failure up to this maximum. To avoid connection storms, a randomization factor of 0.2 will be applied to the timeout resulting in a random range between 20% below and 20% above the computed value.","headers":{"Type":"long","Default":"30000 (30 seconds)","Valid Values":"[0,...]","Importance":"low"}},{"name":"socket.connection.setup.timeout.ms","documentation":"The amount of time the client will wait for the socket connection to be established. If the connection is not built before the timeout elapses, clients will close the socket channel.","headers":{"Type":"long","Default":"10000 (10 seconds)","Valid Values":"[0,...]","Importance":"low"}},{"name":"ssl.cipher.suites","documentation":"A list of cipher suites. This is a named combination of authentication, encryption, MAC and key exchange algorithm used to negotiate the security settings for a network connection using TLS or SSL network protocol. By default all the available cipher suites are supported.","headers":{"Type":"list","Default":"null","Valid Values":"","Importance":"low"}},{"name":"ssl.client.auth","documentation":"Configures kafka broker to request client authentication. The following settings are common:  <ul> <li><code>ssl.client.auth=required</code> If set to required client authentication is required. <li><code>ssl.client.auth=requested</code> This means client authentication is optional. unlike required, if this option is set client can choose not to provide authentication information about itself <li><code>ssl.client.auth=none</code> This means client authentication is not needed.</ul>","headers":{"Type":"string","Default":"none","Valid Values":"[required, requested, none]","Importance":"low"}},{"name":"ssl.endpoint.identification.algorithm","documentation":"The endpoint identification algorithm to validate server hostname using server certificate. ","headers":{"Type":"string","Default":"https","Valid Values":"","Importance":"low"}},{"name":"ssl.engine.factory.class","documentation":"The class of type org.apache.kafka.common.security.auth.SslEngineFactory to provide SSLEngine objects. Default value is org.apache.kafka.common.security.ssl.DefaultSslEngineFactory","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"low"}},{"name":"ssl.keymanager.algorithm","documentation":"The algorithm used by key manager factory for SSL connections. Default value is the key manager factory algorithm configured for the Java Virtual Machine.","headers":{"Type":"string","Default":"SunX509","Valid Values":"","Importance":"low"}},{"name":"ssl.secure.random.implementation","documentation":"The SecureRandom PRNG implementation to use for SSL cryptography operations. ","headers":{"Type":"string","Default":"null","Valid Values":"","Importance":"low"}},{"name":"ssl.trustmanager.algorithm","documentation":"The algorithm used by trust manager factory for SSL connections. Default value is the trust manager factory algorithm configured for the Java Virtual Machine.","headers":{"Type":"string","Default":"PKIX","Valid Values":"","Importance":"low"}},{"name":"status.storage.partitions","documentation":"The number of partitions used when creating the status storage topic","headers":{"Type":"int","Default":"5","Valid Values":"Positive number, or -1 to use the broker's default","Importance":"low"}},{"name":"status.storage.replication.factor","documentation":"Replication factor used when creating the status storage topic","headers":{"Type":"short","Default":"3","Valid Values":"Positive number not larger than the number of brokers in the Kafka cluster, or -1 to use the broker's default","Importance":"low"}},{"name":"task.shutdown.graceful.timeout.ms","documentation":"Amount of time to wait for tasks to shutdown gracefully. This is the total amount of time, not per task. All task have shutdown triggered, then they are waited on sequentially.","headers":{"Type":"long","Default":"5000 (5 seconds)","Valid Values":"","Importance":"low"}},{"name":"topic.creation.enable","documentation":"Whether to allow automatic creation of topics used by source connectors, when source connectors are configured with `topic.creation.` properties. Each task will use an admin client to create its topics and will not depend on the Kafka brokers to create topics automatically.","headers":{"Type":"boolean","Default":"true","Valid Values":"","Importance":"low"}},{"name":"topic.tracking.allow.reset","documentation":"If set to true, it allows user requests to reset the set of active topics per connector.","headers":{"Type":"boolean","Default":"true","Valid Values":"","Importance":"low"}},{"name":"topic.tracking.enable","documentation":"Enable tracking the set of active topics per connector during runtime.","headers":{"Type":"boolean","Default":"true","Valid Values":"","Importance":"low"}}]
