[{"name":"name","documentation":"Globally unique name to use for this connector.","headers":{"Type":"string","Default":"","Valid Values":"non-empty string without ISO control characters","Importance":"high"}},{"name":"connector.class","documentation":"Name or alias of the class for this connector. Must be a subclass of org.apache.kafka.connect.connector.Connector. If the connector is org.apache.kafka.connect.file.FileStreamSinkConnector, you can either specify this full name,  or use \"FileStreamSink\" or \"FileStreamSinkConnector\" to make the configuration a bit shorter","headers":{"Type":"string","Default":"","Valid Values":"","Importance":"high"}},{"name":"tasks.max","documentation":"Maximum number of tasks to use for this connector.","headers":{"Type":"int","Default":"1","Valid Values":"[1,...]","Importance":"high"}},{"name":"topics","documentation":"List of topics to consume, separated by commas","headers":{"Type":"list","Default":"\"\"","Valid Values":"","Importance":"high"}},{"name":"topics.regex","documentation":"Regular expression giving topics to consume. Under the hood, the regex is compiled to a <code>java.util.regex.Pattern</code>. Only one of topics or topics.regex should be specified.","headers":{"Type":"string","Default":"\"\"","Valid Values":"valid regex","Importance":"high"}},{"name":"key.converter","documentation":"Converter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the keys in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro.","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"low"}},{"name":"value.converter","documentation":"Converter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the values in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro.","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"low"}},{"name":"header.converter","documentation":"HeaderConverter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the header values in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro. By default, the SimpleHeaderConverter is used to serialize header values to strings and deserialize them by inferring the schemas.","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"low"}},{"name":"config.action.reload","documentation":"The action that Connect should take on the connector when changes in external configuration providers result in a change in the connector's configuration properties. A value of 'none' indicates that Connect will do nothing. A value of 'restart' indicates that Connect should restart/reload the connector with the updated configuration properties.The restart may actually be scheduled in the future if the external configuration provider indicates that a configuration value will expire in the future.","headers":{"Type":"string","Default":"restart","Valid Values":"[none, restart]","Importance":"low"}},{"name":"transforms","documentation":"Aliases for the transformations to be applied to records.","headers":{"Type":"list","Default":"\"\"","Valid Values":"non-null string, unique transformation aliases","Importance":"low"}},{"name":"predicates","documentation":"Aliases for the predicates used by transformations.","headers":{"Type":"list","Default":"\"\"","Valid Values":"non-null string, unique predicate aliases","Importance":"low"}},{"name":"errors.retry.timeout","documentation":"The maximum duration in milliseconds that a failed operation will be reattempted. The default is 0, which means no retries will be attempted. Use -1 for infinite retries.","headers":{"Type":"long","Default":"0","Valid Values":"","Importance":"medium"}},{"name":"errors.retry.delay.max.ms","documentation":"The maximum duration in milliseconds between consecutive retry attempts. Jitter will be added to the delay once this limit is reached to prevent thundering herd issues.","headers":{"Type":"long","Default":"60000 (1 minute)","Valid Values":"","Importance":"medium"}},{"name":"errors.tolerance","documentation":"Behavior for tolerating errors during connector operation. 'none' is the default value and signals that any error will result in an immediate connector task failure; 'all' changes the behavior to skip over problematic records.","headers":{"Type":"string","Default":"none","Valid Values":"[none, all]","Importance":"medium"}},{"name":"errors.log.enable","documentation":"If true, write each error and the details of the failed operation and problematic record to the Connect application log. This is 'false' by default, so that only errors that are not tolerated are reported.","headers":{"Type":"boolean","Default":"false","Valid Values":"","Importance":"medium"}},{"name":"errors.log.include.messages","documentation":"Whether to include in the log the Connect record that resulted in a failure.For sink records, the topic, partition, offset, and timestamp will be logged. For source records, the key and value (and their schemas), all headers, and the timestamp, Kafka topic, Kafka partition, source partition, and source offset will be logged. This is 'false' by default, which will prevent record keys, values, and headers from being written to log files.","headers":{"Type":"boolean","Default":"false","Valid Values":"","Importance":"medium"}},{"name":"errors.deadletterqueue.topic.name","documentation":"The name of the topic to be used as the dead letter queue (DLQ) for messages that result in an error when processed by this sink connector, or its transformations or converters. The topic name is blank by default, which means that no messages are to be recorded in the DLQ.","headers":{"Type":"string","Default":"\"\"","Valid Values":"","Importance":"medium"}},{"name":"errors.deadletterqueue.topic.replication.factor","documentation":"Replication factor used to create the dead letter queue topic when it doesn't already exist.","headers":{"Type":"short","Default":"3","Valid Values":"","Importance":"medium"}},{"name":"errors.deadletterqueue.context.headers.enable","documentation":"If true, add headers containing error context to the messages written to the dead letter queue. To avoid clashing with headers from the original record, all error context header keys, all error context header keys will start with <code>__connect.errors.</code>","headers":{"Type":"boolean","Default":"false","Valid Values":"","Importance":"medium"}}]
