[{"name":"name","documentation":"Globally unique name to use for this connector.","headers":{"Type":"string","Default":"","Valid Values":"non-empty string without ISO control characters","Importance":"high"}},{"name":"connector.class","documentation":"Name or alias of the class for this connector. Must be a subclass of org.apache.kafka.connect.connector.Connector. If the connector is org.apache.kafka.connect.file.FileStreamSinkConnector, you can either specify this full name,  or use \"FileStreamSink\" or \"FileStreamSinkConnector\" to make the configuration a bit shorter","headers":{"Type":"string","Default":"","Valid Values":"","Importance":"high"}},{"name":"tasks.max","documentation":"Maximum number of tasks to use for this connector.","headers":{"Type":"int","Default":"1","Valid Values":"[1,...]","Importance":"high"}},{"name":"key.converter","documentation":"Converter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the keys in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro.","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"low"}},{"name":"value.converter","documentation":"Converter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the values in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro.","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"low"}},{"name":"header.converter","documentation":"HeaderConverter class used to convert between Kafka Connect format and the serialized form that is written to Kafka. This controls the format of the header values in messages written to or read from Kafka, and since this is independent of connectors it allows any connector to work with any serialization format. Examples of common formats include JSON and Avro. By default, the SimpleHeaderConverter is used to serialize header values to strings and deserialize them by inferring the schemas.","headers":{"Type":"class","Default":"null","Valid Values":"","Importance":"low"}},{"name":"config.action.reload","documentation":"The action that Connect should take on the connector when changes in external configuration providers result in a change in the connector's configuration properties. A value of 'none' indicates that Connect will do nothing. A value of 'restart' indicates that Connect should restart/reload the connector with the updated configuration properties.The restart may actually be scheduled in the future if the external configuration provider indicates that a configuration value will expire in the future.","headers":{"Type":"string","Default":"restart","Valid Values":"[none, restart]","Importance":"low"}},{"name":"transforms","documentation":"Aliases for the transformations to be applied to records.","headers":{"Type":"list","Default":"\"\"","Valid Values":"non-null string, unique transformation aliases","Importance":"low"}},{"name":"predicates","documentation":"Aliases for the predicates used by transformations.","headers":{"Type":"list","Default":"\"\"","Valid Values":"non-null string, unique predicate aliases","Importance":"low"}},{"name":"errors.retry.timeout","documentation":"The maximum duration in milliseconds that a failed operation will be reattempted. The default is 0, which means no retries will be attempted. Use -1 for infinite retries.","headers":{"Type":"long","Default":"0","Valid Values":"","Importance":"medium"}},{"name":"errors.retry.delay.max.ms","documentation":"The maximum duration in milliseconds between consecutive retry attempts. Jitter will be added to the delay once this limit is reached to prevent thundering herd issues.","headers":{"Type":"long","Default":"60000 (1 minute)","Valid Values":"","Importance":"medium"}},{"name":"errors.tolerance","documentation":"Behavior for tolerating errors during connector operation. 'none' is the default value and signals that any error will result in an immediate connector task failure; 'all' changes the behavior to skip over problematic records.","headers":{"Type":"string","Default":"none","Valid Values":"[none, all]","Importance":"medium"}},{"name":"errors.log.enable","documentation":"If true, write each error and the details of the failed operation and problematic record to the Connect application log. This is 'false' by default, so that only errors that are not tolerated are reported.","headers":{"Type":"boolean","Default":"false","Valid Values":"","Importance":"medium"}},{"name":"errors.log.include.messages","documentation":"Whether to include in the log the Connect record that resulted in a failure.For sink records, the topic, partition, offset, and timestamp will be logged. For source records, the key and value (and their schemas), all headers, and the timestamp, Kafka topic, Kafka partition, source partition, and source offset will be logged. This is 'false' by default, which will prevent record keys, values, and headers from being written to log files.","headers":{"Type":"boolean","Default":"false","Valid Values":"","Importance":"medium"}},{"name":"topic.creation.groups","documentation":"Groups of configurations for topics created by source connectors","headers":{"Type":"list","Default":"\"\"","Valid Values":"non-null string, unique topic creation groups","Importance":"low"}},{"name":"exactly.once.support","documentation":"Permitted values are requested, required. If set to \"required\", forces a preflight check for the connector to ensure that it can provide exactly-once semantics with the given configuration. Some connectors may be capable of providing exactly-once semantics but not signal to Connect that they support this; in that case, documentation for the connector should be consulted carefully before creating it, and the value for this property should be set to \"requested\". Additionally, if the value is set to \"required\" but the worker that performs preflight validation does not have exactly-once support enabled for source connectors, requests to create or validate the connector will fail.","headers":{"Type":"string","Default":"requested","Valid Values":"(case insensitive) [REQUIRED, REQUESTED]","Importance":"medium"}},{"name":"transaction.boundary","documentation":"Permitted values are: poll, interval, connector. If set to 'poll', a new producer transaction will be started and committed for every batch of records that each task from this connector provides to Connect. If set to 'connector', relies on connector-defined transaction boundaries; note that not all connectors are capable of defining their own transaction boundaries, and in that case, attempts to instantiate a connector with this value will fail. Finally, if set to 'interval', commits transactions only after a user-defined time interval has passed.","headers":{"Type":"string","Default":"poll","Valid Values":"(case insensitive) [INTERVAL, POLL, CONNECTOR]","Importance":"medium"}},{"name":"transaction.boundary.interval.ms","documentation":"If 'transaction.boundary' is set to 'interval', determines the interval for producer transaction commits by connector tasks. If unset, defaults to the value of the worker-level 'offset.flush.interval.ms' property. It has no effect if a different transaction.boundary is specified.","headers":{"Type":"long","Default":"null","Valid Values":"[0,...]","Importance":"low"}},{"name":"offsets.storage.topic","documentation":"The name of a separate offsets topic to use for this connector. If empty or not specified, the worker’s global offsets topic name will be used. If specified, the offsets topic will be created if it does not already exist on the Kafka cluster targeted by this connector (which may be different from the one used for the worker's global offsets topic if the bootstrap.servers property of the connector's producer has been overridden from the worker's). Only applicable in distributed mode; in standalone mode, setting this property will have no effect.","headers":{"Type":"string","Default":"null","Valid Values":"non-empty string","Importance":"low"}}]
