[
  {
    "Option": "<code>unsecuredLoginStringClaim_&lt;claimname&gt;=\"value\"</code>",
    "Documentation": "Creates a <code>String</code> claim with the given name and value. Any valid claim name can be specified except <code>'iat'</code> and <code>'exp'</code> (these are automatically generated)."
  },
  {
    "Option": "<code>unsecuredLoginNumberClaim_&lt;claimname&gt;=\"value\"</code>",
    "Documentation": "Creates a <code>Number</code> claim with the given name and value. Any valid claim name can be specified except <code>'iat'</code> and <code>'exp'</code> (these are automatically generated)."
  },
  {
    "Option": "<code>unsecuredLoginListClaim_&lt;claimname&gt;=\"value\"</code>",
    "Documentation": "Creates a <code>String List</code> claim with the given name and values parsed from the given value where the first character is taken as the delimiter. For example: unsecuredLoginListClaim_fubar=\"|value1|value2\". Any valid claim name can be specified except <code>'iat'</code> and <code>'exp'</code> (these are automatically generated)."
  },
  {
    "Option": "<code>unsecuredLoginExtension_&lt;claimname&gt;=\"value\"</code>",
    "Documentation": "Creates a <code>String</code> extension with the given name and value. For example: <code>unsecuredLoginExtension_traceId=\"123\"</code>. A valid extension name is any sequence of lowercase or uppercase alphabet characters. In addition, the <code>'auth'</code> extension name is reserved. A valid extension value is any combination of characters with ASCII codes 1-127."
  },
  {
    "Option": "<code>unsecuredLoginPrincipalClaimName</code>",
    "Documentation": "Set to a custom claim name if you wish the name of the <code>String</code> claim holding the principal name to be something other than <code>'sub'</code>."
  },
  {
    "Option": "<code>unsecuredLoginLifetimeSeconds</code>",
    "Documentation": "Set to an integer value if the token expiration is to be set to something other than the default value of 3600 seconds (which is 1 hour). The <code>'exp'</code> claim will be set to reflect the expiration time."
  },
  {
    "Option": "<code>unsecuredLoginScopeClaimName</code>",
    "Documentation": "Set to a custom claim name if you wish the name of the <code>String</code> or <code>String List</code> claim holding any token scope to be something other than <code>'scope'</code>."
  }
]