// Licensed to the Apache Software Foundation (ASF) under one or more
// contributor license agreements.  See the NOTICE file distributed with
// this work for additional information regarding copyright ownership.
// The ASF licenses this file to You under the Apache License, Version 2.0
// (the "License"); you may not use this file except in compliance with
// the License.  You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

{
  "type": "header",
  "name": "RequestHeader",

  // Kafka clients send out the request header before sending any request.
  //
  // The request header doesn't have an explicit version number attached to it.
  // Instead, the server must deduce what version of the request header is in
  // use by examining the first two fields we were sent: RequestApiKey and
  // RequestApiVersion.  Every (apiKey, apiVersion) tuple maps to a unique
  // header version.
  //
  // Version 0 of this header was used only by v0 of the controlled shutdown request.
  // No other requests ever used this version.
  //
  // Version 1 of the header is used by requests that do not have a flexible schema.
  //
  // Version 2 is the first flexible version.

  "validVersions": "0-2",
  "flexibleVersions": "2+",
  "fields": [
    { "name": "RequestApiKey", "type": "int16", "versions": "0+",
      "about": "The API key of this request." },
    { "name": "RequestApiVersion", "type": "int16", "versions": "0+",
      "about": "The API version of this request." },
    { "name": "CorrelationId", "type": "int32", "versions": "0+",
      "about": "The correlation ID of this request." },
    // The clientID is always serialized with a two-byte prefix, even in versions
    // of this message with a flexible schema.
    { "name": "ClientId", "type": "string", "versions": "1+", "ignorable": true,
      "about": "The client ID string.", "flexibleVersions": "none" }
  ]
}
